In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = {1 : [1,2,3], 2 : [4,5,6], 3 : [1,5,7]}

In [4]:
df

{1: [1, 2, 3], 2: [4, 5, 6], 3: [1, 5, 7]}

In [6]:
df1 = pd.DataFrame(np.random.rand(3,2),index=np.arange(3))

In [7]:
df1

          0         1
0  0.595102  0.188041
1  0.413836  0.678706
2  0.458239  0.889379

In [9]:
df1.describe()

              0         1
count  3.000000  3.000000
mean   0.489059  0.585375
std    0.094481  0.359864
min    0.413836  0.188041
25%    0.436037  0.433373
50%    0.458239  0.678706
75%    0.526670  0.784043
max    0.595102  0.889379

In [10]:
df1.mean()

0    0.489059
1    0.585375
dtype: float64

In [12]:
df1.median()

0    0.458239
1    0.678706
dtype: float64

In [13]:
df1.std()

0    0.094481
1    0.359864
dtype: float64

In [14]:
df1.loc[0,0 ]=50

In [15]:
df1

           0         1
0  50.000000  0.188041
1   0.413836  0.678706
2   0.458239  0.889379

In [16]:
df1.columns=list("AB")

In [17]:
df1

           A         B
0  50.000000  0.188041
1   0.413836  0.678706
2   0.458239  0.889379

In [19]:
df1.head(1)

      A         B
0  50.0  0.188041

In [20]:
df1.drop(0)

          A         B
1  0.413836  0.678706
2  0.458239  0.889379

In [23]:
df1.drop('A',axis=1)

          B
0  0.188041
1  0.678706
2  0.889379

In [24]:
df1

           A         B
0  50.000000  0.188041
1   0.413836  0.678706
2   0.458239  0.889379

In [25]:
df1[0,1]=10

In [26]:
df1

           A         B  (0, 1)
0  50.000000  0.188041      10
1   0.413836  0.678706      10
2   0.458239  0.889379      10

In [30]:
df1

           A         B  (0, 1)
0  50.000000  0.188041      10
1   0.413836  0.678706      10
2   0.458239  0.889379      10

In [31]:
df1[0,'A']=70

In [32]:
df1

           A         B  (0, 1)  (0, A)
0  50.000000  0.188041      10      70
1   0.413836  0.678706      10      70
2   0.458239  0.889379      10      70

In [34]:
df1.loc[0,'B']=100

In [35]:
df1

           A           B  (0, 1)  (0, A)
0  50.000000  100.000000      10      70
1   0.413836    0.678706      10      70
2   0.458239    0.889379      10      70

In [36]:
type(df1)

pandas.core.frame.DataFrame

In [37]:
df1.dtypes

A         float64
B         float64
(0, 1)      int64
(0, A)      int64
dtype: object

In [43]:
df2 = df1.T

In [41]:
df1.sort_index(axis=0)

           A           B  (0, 1)  (0, A)
0  50.000000  100.000000      10      70
1   0.413836    0.678706      10      70
2   0.458239    0.889379      10      70

In [42]:
df1

           A           B  (0, 1)  (0, A)
0  50.000000  100.000000      10      70
1   0.413836    0.678706      10      70
2   0.458239    0.889379      10      70

In [44]:
df1.loc[1,'A']=1

In [45]:
df1

           A           B  (0, 1)  (0, A)
0  50.000000  100.000000      10      70
1   1.000000    0.678706      10      70
2   0.458239    0.889379      10      70

In [46]:
df1.loc[[1,2],['A','B']]

          A         B
1  1.000000  0.678706
2  0.458239  0.889379

In [47]:
df1

           A           B  (0, 1)  (0, A)
0  50.000000  100.000000      10      70
1   1.000000    0.678706      10      70
2   0.458239    0.889379      10      70

In [49]:
df1.iloc[[1,2],[0,1]]

          A         B
1  1.000000  0.678706
2  0.458239  0.889379

In [50]:
df1

           A           B  (0, 1)  (0, A)
0  50.000000  100.000000      10      70
1   1.000000    0.678706      10      70
2   0.458239    0.889379      10      70